Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
import pandas as pd
import logging

logging.basicConfig(filename="test.log",level=logging.INFO,format="%(asctime)s %(message)s")
l=[4, 8, 15, 16, 23,42]
series=pd.Series(l)
logging.info(series)

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [11]:
import pandas as pd
import logging

logging.basicConfig(filename="test.log",level=logging.INFO,format="%(asctime)s %(message)s")
l2=[1,2,3,1,3,4,5,7,4,5]
ries=pd.Series(l2)
logging.info(ries)

Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
import pandas as pd
import logging

logging.basicConfig(filename="test.log",level=logging.INFO,format="%(asctime)s %(message)s")
data={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
df=pd.DataFrame(data)
logging.info(df)

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

AnsL In Pandas, a DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It is essentially a table with rows and columns, where each column can contain different data types (e.g., numbers, strings, dates) and each row represents an observation or record. DataFrames are one of the most commonly used data structures in Pandas and are similar to spreadsheets or SQL tables.

On the other hand, a Pandas Series is a one-dimensional array-like object that can hold data of any data type. It is essentially a single column of data with associated labels or indices. You can think of a Series as a single column extracted from a DataFrame.

In [15]:
import pandas as pd
import logging

logging.basicConfig(filename="test.log",level=logging.INFO,format="%(asctime)s %(message)s")
data={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
df=pd.DataFrame(data)
logging.info(df)

In the above code, we created a DataFrame df with three columns: 'Name', 'Age', and 'City'. It represents a tabular structure with multiple rows and columns.

In [18]:
age_series = df['Age']
print("\nSeries:")
print(age_series)

Series:
0    25
1    30
2    27
Name: Age, dtype: int64

In this case, age_series is a Pandas Series that contains only the 'Age' column data from the original DataFrame. It's a one-dimensional object with the index preserved.

In summary, a DataFrame is a two-dimensional data structure that holds multiple columns of data, while a Series is a one-dimensional data structure that represents a single column of data from a DataFrame.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

There are many functions available in Pandas for manipulating data in a DataFrame. Here are some of the most common ones:

head() and tail(): These functions allow you to view the first or last n rows of the DataFrame, respectively. For example, df.head(10) would show the first 10 rows of the DataFrame.

info(): This function provides information about the DataFrame, including the data types of each column and the number of non-null values. For example, df.info() would show information about the DataFrame.

describe(): This function generates descriptive statistics for the DataFrame, including count, mean, standard deviation, minimum, and maximum values. For example, df.describe() would show descriptive statistics for the DataFrame.

drop(): This function allows you to drop one or more columns or rows from the DataFrame. For example, df.drop('column_name', axis=1) would drop the specified column from the DataFrame.

groupby(): This function groups the DataFrame by one or more columns and allows you to perform operations on each group. For example, df.groupby('column_name').sum() would group the DataFrame by the specified column and calculate the sum of each group.

sort_values(): This function allows you to sort the DataFrame by one or more columns. For example, df.sort_values('column_name') would sort the DataFrame by the specified column.

fillna(): This function allows you to replace missing values in the DataFrame with a specified value. For example, df.fillna(0) would replace all missing values in the DataFrame with 0.

One example of when you might use these functions is when you are analyzing sales data for a company. You could use head() to quickly view the first few rows of the DataFrame to get an idea of what the data looks like. You could use groupby() to group the data by region and calculate the total sales for each region. You could use sort_values() to sort the data by date to see how sales have changed over time. And you could use fillna() to replace any missing values in the data with zeros so that you can perform calculations on the data without errors.

In [30]:
import pandas as pd

data={
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [41]:
df.drop("Name",axis=1)

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

In [42]:
ages = df['Age']
ages

0    25
1    30
2    27
Name: Age, dtype: int64

In [31]:
adults=df[df["Age"]>29]
print(adults)

  Name  Age Gender
1  Bob   30   Male

In [37]:
df_sort=df.sort_values("Age")
df_sort

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [38]:
df.groupby("Age").sum()

       Name  Gender
Age
25    Alice  Female
27   Claire  Female
30      Bob    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, while Panel is not. This means that you can modify the data in a Series or DataFrame after it has been created, but you cannot modify the data in a Panel after it has been created

Q7. Create a DataFrame using multiple Series. Explain with an example.

To create a DataFrame using multiple Series, we can pass a dictionary of Series to the pd.DataFrame() function. Each key in the dictionary will become a column name in the DataFrame, and each value will become a Series in that column.

In [47]:
import pandas as pd
import logging

logging.basicConfig(filename="test.log",level=logging.INFO,format="%(asctime)s %(message)s")


name=pd.Series(['Alice' , 'Bob' , 'Claire'])
age=pd.Series([25,30,22])
gender=pd.Series(['Female','Male','Female'])

d={'Name':name , 'Age': age , 'Gender':gender}

df1=pd.DataFrame(d)

logging.info(df1)

In [48]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   22  Female